Repository: Henkienak/Beetle.js
Catalog: Beetle.Server/Properties/Resources.*.resx
Languages: tr_tr

# CannotChangeQueryType
source: Cannot change query type for non-generic queries.
tr_tr: Generic olmayan tipler için sorgu tipi değiştirilemez.

# CannotFindAnyKey
source: Cannot find any key for '{0}'.
tr_tr: '{0}' için anahtar değer bulunamadı.

# CannotFindMetadata
source: Cannot find metadata for '{0}'.
tr_tr: '{0}' için metadata bulunamadı.

# CannotFindPublicInstanceFieldOrProperty
source: Cannot find public '{0}' instance field or property.
tr_tr: Erişilebilir '{0}' alanı bulunamadı.

source: Cannot find tracker info.
tr_tr: Takip objesi bulunamadı.

# CannotFindTypeInformation
source: Cannot find type information for '{0}'.
tr_tr: '{0}' için tip bilgisi bulunamadı.

# CannotGetGeneratedValues
source: Cannot get generated values, when EntityType is not available in EntityBag, Metadata parameter must be given.
tr_tr: Üretilen değerler okunamadı, EntityBag objesinde EntityType boş iken Metadata parametresi geçilmelidir.

# CannotSaveEntityWithState
source: Cannot save entity with state '{0}'.
tr_tr: Varlık '{0}' durumunda kaydedilemez.

# CannotSetReadOnlyProperty
source: Cannot set read-only '{0}' property.
tr_tr: Sadece okunabilir '{0}' alanına yazılamadı.

source: Connection cannot be null.
tr_tr: Bağlantı null olamaz.

# DeleteAffectedUnexpectedNumberOfRows
source: Delete command affected an unexpected number of rows. Entities may have been modified or deleted since last read.
tr_tr: Silme komutu beklenenden farklı kayıdı etkiledi, varlıklar son okumadan sonra değiştirilmiş ya da silinmiş olabilir.

source: Entity and ClientEntity must be same type to compare.
tr_tr: Karşılaştırma için istemci ve server varlıkları aynı tipte olmalıdır.

# EntityTypeCannotBeFound
source: Entity type cannot be found for '{0}'.
tr_tr: '{0}' varlık tipi bulunamadı.

# InsertAffectedUnexpectedNumberOfRows
source: Insert command affected an unexpected number of rows.
tr_tr: Ekleme komutu beklenenden farklı kayıdı etkiledi.

# InvalidGroupByExpression
source: Invalid group by expression: '{0}'.
tr_tr: Geçersiz grup ifadesi: '{0}'.

# MaxLenError
source: {0} property length cannot exceed {1}.
tr_tr: {0} alanı uzunluğu {1} değerinden fazla olamaz.

# OriginalValuePropertyCouldNotBeFound
source: Original value property could not be found for '{0}'.
tr_tr: '{0}' için orjinal değerler alanı bulunamadı.

# ResultCountExceeded
source: Result count exceeded the allowed limit.
tr_tr: Sonuç sayısı maksimum izin verilen limiti aştı.

# TypeCouldNotBeFound
source: Type could not be found: {0}
tr_tr: Tip bulunamadı: {0}

# UnknownBeetleQueryExecuterParameter
source: Unknown beetle query executer parameter: '{0}'.
tr_tr: Tanınmayan beetle sorgu çalıştırma ifadesi: '{0}'.

# UnknownBeetleQueryParameter
source: Unknown beetle query parameter: '{0}'.
tr_tr: Tanınmayan beetle sorgu ifadesi: '{0}'.

# UpdateAffectedUnexpectedNumberOfRows
source: Update command affected an unexpected number of rows. Entities may have been modified or deleted since last read.
tr_tr: Güncelleme komutu beklenenden farklı kayıdı etkiledi, varlıklar son okumadan sonra değiştirilmiş ya da silinmiş olabilir.
